config/test/contracts/test/contract-core-spec.org
#+title: Contract Core Tests — Validating the Validation Primitives
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle contract-core-spec.el
#+auto_tangle: y

* Purpose

These tests validate the generic contract primitives themselves — the building
blocks that all boundary-specific contracts are constructed from.

This is the foundation layer. If these primitives are wrong, every contract built
on top of them is unreliable. The tests verify both *accept* and *reject*
behavior, because a validator that accepts everything is useless — it would never
catch a mismatch.

** What This File Tests (Not a Boundary)

Unlike the bash-parser contract tests, this file doesn't test a specific module
boundary. It tests the validation /toolkit/:

- =contract--validate-plist= — does it correctly enforce required keys, optional
  keys, and type predicates?
- =contract--validate-alist= — does it detect when someone passes a plist where
  an alist is expected?
- =contract--validate-plist-in-list= — does it validate each item in a collection?
- =:to-satisfy-contract= matcher — does it produce useful failure messages in
  Buttercup output?

** Relationship to Other Contract Files

#+begin_example
contract-core.el (primitives)     ◄── THIS FILE TESTS THIS
    ↓ used by
contract-bash-parser.el (bash-parser boundary contracts)
    ↓ used by
helpers-spec.el (self-validating mocks)
    ↓ used by
scope tests (468+ specs)
    ↓ also used by
bash-parser-integration-spec.el (real end-to-end wiring)
#+end_example

* Setup

Load the contract primitives and register the Buttercup matcher.

#+begin_src emacs-lisp
;;; contract-core-spec.el --- Tests for contract validation primitives -*- lexical-binding: t; -*-

;;; Commentary:

;; Tests for contract-core.el validation primitives.

;;; Code:

(require 'buttercup)

;; Add contracts directory to load-path
(let ((contracts-dir (expand-file-name "../" (file-name-directory (or load-file-name buffer-file-name)))))
  (add-to-list 'load-path contracts-dir))

(require 'contract-core)

;; Register matcher after buttercup is loaded
(contract--register-buttercup-matcher)
#+end_src

* Plist Validator Tests

The plist validator is the workhorse — most contracts are plist shape checks.
These tests cover the key behaviors:

- Required keys must be present and satisfy their predicate
- Optional keys are ignored when absent, validated when present
- Non-plist input is caught early
- Multiple errors are collected (not just the first one)

#+begin_src emacs-lisp
(describe "contract--validate-plist"
  (it "returns nil for valid plist with all required keys"
    (let ((data '(:name "test" :count 5 :active t)))
      (expect (contract--validate-plist data
                '((:name stringp) (:count integerp) (:active booleanp)))
              :to-be nil)))

  (it "returns error for missing required key"
    (let ((data '(:name "test")))
      (expect (contract--validate-plist data
                '((:name stringp) (:count integerp)))
              :to-match "Missing required key :count")))

  (it "returns error when value fails predicate"
    (let ((data '(:name 42)))
      (expect (contract--validate-plist data
                '((:name stringp)))
              :to-match "does not satisfy")))

  (it "accepts valid optional keys"
    (let ((data '(:name "test" :extra "bonus")))
      (expect (contract--validate-plist data
                '((:name stringp))
                '((:extra stringp)))
              :to-be nil)))

  (it "ignores absent optional keys"
    (let ((data '(:name "test")))
      (expect (contract--validate-plist data
                '((:name stringp))
                '((:extra stringp)))
              :to-be nil)))

  (it "validates optional key type when present"
    (let ((data '(:name "test" :extra 42)))
      (expect (contract--validate-plist data
                '((:name stringp))
                '((:extra stringp)))
              :to-match "Optional key :extra")))

  (it "returns error for non-list input"
    (expect (contract--validate-plist "not a plist"
              '((:name stringp)))
            :to-match "Expected plist"))

  (it "collects multiple errors"
    (let ((data '(:name 42)))
      (expect (contract--validate-plist data
                '((:name stringp) (:count integerp)))
              :to-match "Missing required key :count"))))
#+end_src

* Alist Validator Tests

The alist validator exists specifically to catch the *plist-get-on-alist* bug class.
In Emacs Lisp, =plist-get= on an alist silently returns nil — it doesn't error.
This makes it a particularly insidious source of bugs: everything /appears/ to
work, but every lookup returns nil.

The critical test is "catches plist masquerading as alist" — this is the exact
pattern that caused the domains mismatch in production.

#+begin_src emacs-lisp
(describe "contract--validate-alist"
  (it "returns nil for valid alist"
    (let ((data '((:a . 1) (:b . 2))))
      (expect (contract--validate-alist data '(:a :b))
              :to-be nil)))

  (it "returns error for unknown key"
    (let ((data '((:a . 1) (:c . 3))))
      (expect (contract--validate-alist data '(:a :b))
              :to-match "Unknown alist key :c")))

  (it "catches plist masquerading as alist"
    (let ((data '(:a 1 :b 2)))  ; This is a plist, not alist
      (expect (contract--validate-alist data '(:a :b))
              :to-match "not a cons cell")))

  (it "validates value predicate"
    (let ((data '((:a . "not a list"))))
      (expect (contract--validate-alist data '(:a) #'listp)
              :to-match "does not satisfy")))

  (it "returns nil for empty alist"
    (expect (contract--validate-alist nil '(:a :b))
            :to-be nil))

  (it "returns error for non-list input"
    (expect (contract--validate-alist "not an alist" '(:a))
            :to-match "Expected alist")))
#+end_src

* List-of-Items Validator Tests

#+begin_src emacs-lisp
(describe "contract--validate-plist-in-list"
  (it "returns nil for valid list"
    (expect (contract--validate-plist-in-list
             '(1 2 3)
             (lambda (x) (if (integerp x) nil "not int")))
            :to-be nil))

  (it "returns error for invalid item"
    (expect (contract--validate-plist-in-list
             '(1 "bad" 3)
             (lambda (x) (if (integerp x) nil "not int")))
            :to-match "Item 1: not int"))

  (it "returns nil for empty list"
    (expect (contract--validate-plist-in-list
             nil
             (lambda (_x) "always fails"))
            :to-be nil)))
#+end_src

* Buttercup Matcher Tests

The =:to-satisfy-contract= matcher wraps contract validators into Buttercup's
assertion syntax. On failure, it reports both the violation description and the
data that failed — making contract violations immediately diagnosable in test output.

#+begin_src emacs-lisp
(describe ":to-satisfy-contract matcher"
  (it "passes when contract is satisfied"
    (let ((data '(:name "test" :count 5)))
      (expect data :to-satisfy-contract
              (lambda (d)
                (contract--validate-plist d
                  '((:name stringp) (:count integerp)))))))

  (it "fails when contract is violated"
    ;; Directly test the validator returns an error string
    (let ((error (contract--validate-plist '(:name 42) '((:name stringp)))))
      (expect error :to-match "does not satisfy"))))
#+end_src

* Provide

#+begin_src emacs-lisp
(provide 'contract-core-spec)

;;; contract-core-spec.el ends here
#+end_src
